In [1]:
import duckdb

In [2]:
con = duckdb.connect(database='dados_duckdb.db',read_only=False)

In [5]:
#select dos dados na camada silve
df = con.execute("SELECT * from produtos").fetchdf()
df.head(10)

   ID_PRODUTO NM_PRODUTO ID_CATEGORIA  ID_FORNECEDOR  VL_PRECO
0       10001   PARAFUSO         BT10            100     100.0
1       10002    MARTELO         BT50            100    1500.0
2       10003      PREGO         BT10            100      60.0
3       10004      SERRA         BT50            100     200.0
4       10005    MACHADO         BT50            100     100.0

In [ ]:
#criar dimensão de produtos na camada gold - remover colunas que não são da dimensão produtos
df_produtos = df.drop(columns=['ID_CATEGORIA','ID_FORNECEDOR'])
df_produtos.head(10)

   ID_PRODUTO NM_PRODUTO  VL_PRECO
0       10001   PARAFUSO     100.0
1       10002    MARTELO    1500.0
2       10003      PREGO      60.0
3       10004      SERRA     200.0
4       10005    MACHADO     100.0

In [7]:
#criação da tabela dim_produtos
con.execute("""
    CREATE TABLE IF NOT EXISTS dim_produtos(
            ID_PRODUTO BIGINT,
            NM_PRODUTO TEXT,
            VL_PRECO FLOAT)
""")

In [9]:
#inserção dos dados na dim_produtos
con.execute("INSERT INTO dim_produtos SELECT * FROM df_produtos")

In [10]:
df_dim_produtos = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim_produtos.head(10)

   ID_PRODUTO NM_PRODUTO  VL_PRECO
0       10001   PARAFUSO     100.0
1       10002    MARTELO    1500.0
2       10003      PREGO      60.0
3       10004      SERRA     200.0
4       10005    MACHADO     100.0